h0lad/MeshCore/src/helpers/stm32/STM32WLxTarget.cpp
// Only the variants that opt in with -D STM32WLX_COMMON_TARGET get these globals;
// helpers/stm32 is globbed into every STM32 build, and the variants that still carry
// their own target.cpp would otherwise define them twice.
#if defined(STM32WLX_COMMON_TARGET)

#include <Arduino.h>
#include <helpers/ArduinoHelpers.h>
#include <helpers/stm32/STM32WLxTarget.h>

STM32WLxBoard board;

RADIO_CLASS radio = new STM32WLx_Module();

WRAPPER_CLASS radio_driver(radio, board);

#ifndef STM32WLX_RFSWITCH_PINS
  #define STM32WLX_RFSWITCH_PINS  LORAWAN_RFSWITCH_PINS
#endif

static const uint32_t rfswitch_pins[] = {STM32WLX_RFSWITCH_PINS,  RADIOLIB_NC, RADIOLIB_NC, RADIOLIB_NC};
static const Module::RfSwitchMode_t rfswitch_table[] = {
  {STM32WLx::MODE_IDLE,  {LOW,  LOW}},
  {STM32WLx::MODE_RX,    {HIGH, LOW}},
  {STM32WLx::MODE_TX_LP, {LOW, HIGH}},
  {STM32WLx::MODE_TX_HP, {LOW, HIGH}},
  END_OF_MODE_TABLE,
};

VolatileRTCClock rtc_clock;
SensorManager sensors;

#ifndef LORA_CR
  #define LORA_CR      5
#endif

#ifndef STM32WL_TCXO_VOLTAGE
  // TCXO set to 0 for RAK3172
  #define STM32WL_TCXO_VOLTAGE 0
#endif

#ifndef LORA_TX_POWER
  #define LORA_TX_POWER 22
#endif

bool radio_init() {
//  rtc_clock.begin(Wire);

  radio.setRfSwitchTable(rfswitch_pins, rfswitch_table);

  int status = radio.begin(LORA_FREQ, LORA_BW, LORA_SF, LORA_CR, RADIOLIB_SX126X_SYNC_WORD_PRIVATE, LORA_TX_POWER, 16, STM32WL_TCXO_VOLTAGE, 0);

  if (status != RADIOLIB_ERR_NONE) {
    Serial.print("ERROR: radio init failed: ");
    Serial.println(status);
    return false;  // fail
  }

  #ifdef RX_BOOSTED_GAIN
    radio.setRxBoostedGainMode(RX_BOOSTED_GAIN);
  #endif

  radio.setCRC(1);

  return true;  // success
}

mesh::LocalIdentity radio_new_identity() {
  RadioNoiseListener rng(radio);
  return mesh::LocalIdentity(&rng);  // create new random identity
}

#endif  // STM32WLX_COMMON_TARGET
